In [7]:
#pandas is a Python library used widely for data manipulation and analysis
import pandas as pd
#Matplotlib is the "grandfather" Python library of data visualization, which help plotting scientific graphs.

import matplotlib.pyplot as plt
#Seaborn is the children of Matplotlib. It helps to create attrative visual charts with just few lines of code.

import seaborn as sns
#sklearn is a machine learning library, which provides a lot of data processing utilities
import sklearn

In [8]:
# Some useful pandas functions
#Import dataset from csv file
df = pd.read_csv('../Data/titanic.csv')

#Display the first 5 rows of the dataset
df.head()

,PassengerId,Survived,PassengerClass,Name,Sex,Age,FamilyMembers,Ticket,Fare,Cabin,Embarked
0,1,No,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,2,Yes,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,3,Yes,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,Yes,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,5,No,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S

In [9]:
#Select a pandas column
df['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [10]:
#Get the mean of a pandas column
df['Age'].mean()

29.69911764705882